In [1]:
import pandas as pd

In [2]:
Name = ['Joe','Mike','Ann','Stephen','Peter','Edward']
Age = [26,17,34,34,29,17]
pd.DataFrame(Name,Age,columns=['Name'])

       Name
26      Joe
17     Mike
34      Ann
34  Stephen
29    Peter
17   Edward

In [3]:
Name = ['Joe','Mike','Ann','Stephen','Peter','Edward']
Age = [26,17,34,34,29,17]
t=pd.DataFrame([Name,Age]).transpose()
t.columns = [['Name','Age']]
t

      Name Age
0      Joe  26
1     Mike  17
2      Ann  34
3  Stephen  34
4    Peter  29
5   Edward  17

In [4]:
Name = ['Joe','Mike','Ann','Stephen','Peter','Edward']
Age = [26,17,34,34,29,17]
pd.DataFrame([Name,Age])

     0     1    2        3      4       5
0  Joe  Mike  Ann  Stephen  Peter  Edward
1   26    17   34       34     29      17

In [5]:
pd.DataFrame(
    {'Name': ['Joe','Mike','Ann','Stephen','Peter','Edward'],
     'Age':[26,17,34,34,29,17]
    
})

      Name  Age
0      Joe   26
1     Mike   17
2      Ann   34
3  Stephen   34
4    Peter   29
5   Edward   17

In [6]:
pd.DataFrame(
    [
    ['Joe',26],
    ['Mike',20],
    ['Ann',34],
    ['Stephen',34],
    ['Peter',29],
    ['Edward',17],
    ],
 columns=[['Name','Age']]
  
)

      Name Age
0      Joe  26
1     Mike  20
2      Ann  34
3  Stephen  34
4    Peter  29
5   Edward  17

In [7]:
l=pd.DataFrame(
    [
    [1,'Joe',26],
    [2,'Mike',20],
    [3,'Ann',34],
    [4,'Stephen',34],
    [5,'Peter',29],
    [6,'Edward',17],
    ],
columns=[['Key','Name','Age']],
index =[['one','two','three','four','five','six']]
  
)
l

      Key     Name Age
one     1      Joe  26
two     2     Mike  20
three   3      Ann  34
four    4  Stephen  34
five    5    Peter  29
six     6   Edward  17

In [8]:
# pd.read_csv("filepath",index_col="")

In [9]:
l = [10,20,30,40,50]
sd = pd.Series(l)
sd

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
sd=pd.Series(l,index=['a','b','c','d','e'])
sd

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [11]:
import numpy as np

In [12]:
a=np.array([60,70,80,90,100])
a

array([ 60,  70,  80,  90, 100])

In [13]:
print(a)

[ 60  70  80  90 100]

In [14]:
sa = pd.Series(a)
sa

0     60
1     70
2     80
3     90
4    100
dtype: int32

In [15]:
d={'a':10,'b':20,'c':30,'d':40}
d

{'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [16]:
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
dt = [('a',10),('b',20),('c',30)]
dt

[('a', 10), ('b', 20), ('c', 30)]

In [18]:
pd.Series(dt)

0    (a, 10)
1    (b, 20)
2    (c, 30)
dtype: object